<?php
/**
 * Created by PhpStorm.
 * User: Igor
 * Date: 11.03.2019
 * Time: 12:27
 */

// Базовый класс для шорткодов страниц и виджетов

class gsModuleBase
{
    protected $user = null;             // текущий пользователь
    protected $alert_text = '';         // используется при вызове gsUtils::Alert()
    protected $alert_class = 'success';

    public function __construct()
    {
        $this->user = new gsUser();
    }
    /************************************************************************************/
    /************************************************************************************/
    /************************************************************************************/
}